# ==============================================================================
# Brewfile — dotfiles dependencies
# Install: brew bundle --file=~/Dev/dotfiles/Brewfile
# ==============================================================================

# Shell
brew "sheldon"          # zsh plugin manager
brew "starship"         # cross-shell prompt
brew "mise"             # runtime version manager (node, python, ruby, etc.)
brew "direnv"           # per-directory environment variables

# Modern CLI tools
brew "eza"              # ls replacement — color, icons, Git status
brew "bat"              # cat replacement — syntax highlighting
brew "ripgrep"          # grep replacement — fast recursive search
brew "fd"               # find replacement — simple syntax
brew "zoxide"           # cd replacement — frequency-based smart jump
brew "dust"             # du replacement — visual disk usage
brew "git-delta"        # diff/git pager — rich highlighting
brew "sd"               # sed replacement — simple regex
brew "btop"             # top replacement — graphical resource monitor
brew "yazi"             # terminal file manager — image preview support

# Fun
brew "cowsay"
brew "lolcat"

# Fonts
cask "font-hack-nerd-font"

# Apps
cask "wezterm"          # GPU-accelerated terminal emulator
